benchmark/static_gunicorn.log
ab -c 10 -n 1000 "http://127.0.0.1:8082/" > ../benchmark/static_gunicorn.log

This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.7.1
Server Hostname:        127.0.0.1
Server Port:            8082

Document Path:          /
Document Length:        30 bytes

Concurrency Level:      10
Time taken for tests:   0.206 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      155000 bytes
HTML transferred:       30000 bytes
Requests per second:    4855.22 [#/sec] (mean)
Time per request:       2.060 [ms] (mean)
Time per request:       0.206 [ms] (mean, across all concurrent requests)
Transfer rate:          734.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    2   2.0      1      22
Waiting:        0    2   1.7      1      21
Total:          1    2   2.0      1      22

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      3
  90%      3
  95%      5
  98%      8
  99%     13
 100%     22 (longest request)