benchmark/static_nginx.log
ab -c 10 -n 1000 "http://127.0.0.1/static.html" > ../benchmark/static_nginx.log


This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /static.html
Document Length:        32 bytes

Concurrency Level:      10
Time taken for tests:   0.049 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      272000 bytes
HTML transferred:       32000 bytes
Requests per second:    20265.48 [#/sec] (mean)
Time per request:       0.493 [ms] (mean)
Time per request:       0.049 [ms] (mean, across all concurrent requests)
Transfer rate:          5383.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    0   0.1      0       1
Waiting:        0    0   0.1      0       1
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      1
  90%      1
  95%      1
  98%      1
  99%      2
 100%      2 (longest request)